dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

//#include "FreeRTOS.h"
//#include "task.h"

#include <core/lv_obj_scroll.h>
#include "fsl_debug_console.h"
#include "lvgl_support.h"
#include "pin_mux.h"
#include "board.h"
#include "lvgl.h"
#include "gui_guider.h"
#include "events_init.h"
#include "custom.h"


// Screen task
#include "Screen_Task.h"

#define RIGHT_PLANE_OFFSET 384
#define RIGHT_LINE_A_LINE_1_X_START (214 + RIGHT_PLANE_OFFSET)  // 598
#define RIGHT_LINE_A_LINE_1_X_END   (RIGHT_LINE_A_LINE_1_X_START+11)
#define RIGHT_LINE_A_LINE_1_Y_START 368 - 1 //369
#define RIGHT_LINE_A_LINE_1_Y_END   (RIGHT_LINE_A_LINE_1_Y_START-1)

#define RIGHT_LINE_A_LINE_2_X_START (RIGHT_LINE_A_LINE_1_X_END -1)
#define RIGHT_LINE_A_LINE_2_X_END   (RIGHT_LINE_A_LINE_2_X_START+11)
#define RIGHT_LINE_A_LINE_2_Y_START RIGHT_LINE_A_LINE_1_Y_END
#define RIGHT_LINE_A_LINE_2_Y_END   (RIGHT_LINE_A_LINE_2_Y_START-1)

#define RIGHT_LINE_A_LINE_3_X_START (RIGHT_LINE_A_LINE_2_X_END -1)
#define RIGHT_LINE_A_LINE_3_X_END   (RIGHT_LINE_A_LINE_3_X_START+11)
#define RIGHT_LINE_A_LINE_3_Y_START RIGHT_LINE_A_LINE_2_Y_END
#define RIGHT_LINE_A_LINE_3_Y_END   (RIGHT_LINE_A_LINE_3_Y_START-1)

#define RIGHT_LINE_A_LINE_4_X_START (RIGHT_LINE_A_LINE_3_X_END -1)
#define RIGHT_LINE_A_LINE_4_X_END   (RIGHT_LINE_A_LINE_4_X_START+11)
#define RIGHT_LINE_A_LINE_4_Y_START RIGHT_LINE_A_LINE_3_Y_END
#define RIGHT_LINE_A_LINE_4_Y_END   (RIGHT_LINE_A_LINE_4_Y_START-1)

#define RIGHT_LINE_A_LINE_5_X_START (RIGHT_LINE_A_LINE_4_X_END -1)
#define RIGHT_LINE_A_LINE_5_X_END   (RIGHT_LINE_A_LINE_5_X_START+11)
#define RIGHT_LINE_A_LINE_5_Y_START RIGHT_LINE_A_LINE_4_Y_END
#define RIGHT_LINE_A_LINE_5_Y_END   (RIGHT_LINE_A_LINE_5_Y_START-1)

#define RIGHT_LINE_A_LINE_6_X_START (RIGHT_LINE_A_LINE_5_X_END -1)
#define RIGHT_LINE_A_LINE_6_X_END   (RIGHT_LINE_A_LINE_6_X_START+11)
#define RIGHT_LINE_A_LINE_6_Y_START RIGHT_LINE_A_LINE_5_Y_END
#define RIGHT_LINE_A_LINE_6_Y_END   (RIGHT_LINE_A_LINE_6_Y_START-1)

#define RIGHT_LINE_A_LINE_7_X_START (RIGHT_LINE_A_LINE_6_X_END -1)
#define RIGHT_LINE_A_LINE_7_X_END   (RIGHT_LINE_A_LINE_7_X_START+11)
#define RIGHT_LINE_A_LINE_7_Y_START RIGHT_LINE_A_LINE_6_Y_END
#define RIGHT_LINE_A_LINE_7_Y_END   (RIGHT_LINE_A_LINE_7_Y_START-1)

#define RIGHT_LINE_A_LINE_8_X_START (RIGHT_LINE_A_LINE_7_X_END -1)
#define RIGHT_LINE_A_LINE_8_X_END   (RIGHT_LINE_A_LINE_8_X_START+11)
#define RIGHT_LINE_A_LINE_8_Y_START RIGHT_LINE_A_LINE_7_Y_END
#define RIGHT_LINE_A_LINE_8_Y_END   (RIGHT_LINE_A_LINE_8_Y_START-1)

#define RIGHT_LINE_A_LINE_9_X_START (RIGHT_LINE_A_LINE_8_X_END -1)
#define RIGHT_LINE_A_LINE_9_X_END   (RIGHT_LINE_A_LINE_9_X_START+11)
#define RIGHT_LINE_A_LINE_9_Y_START RIGHT_LINE_A_LINE_8_Y_END
#define RIGHT_LINE_A_LINE_9_Y_END   (RIGHT_LINE_A_LINE_9_Y_START-1)

#define RIGHT_LINE_A_LINE_10_X_START (RIGHT_LINE_A_LINE_9_X_END -1)   //124
#define RIGHT_LINE_A_LINE_10_X_END   (RIGHT_LINE_A_LINE_10_X_START+11) //360
#define RIGHT_LINE_A_LINE_10_Y_START RIGHT_LINE_A_LINE_9_Y_END         // 113
#define RIGHT_LINE_A_LINE_10_Y_END   (RIGHT_LINE_A_LINE_10_Y_START-1)  // 359


#define RIGHT_LINE_A_LINE_11_X_START (RIGHT_LINE_A_LINE_10_X_END -1)
#define RIGHT_LINE_A_LINE_11_X_END   (RIGHT_LINE_A_LINE_11_X_START+16)
#define RIGHT_LINE_A_LINE_11_Y_START RIGHT_LINE_A_LINE_10_Y_END
#define RIGHT_LINE_A_LINE_11_Y_END   (RIGHT_LINE_A_LINE_11_Y_START-1)

#define RIGHT_LINE_A_LINE_12_X_START (RIGHT_LINE_A_LINE_11_X_END -1)
#define RIGHT_LINE_A_LINE_12_X_END   (RIGHT_LINE_A_LINE_12_X_START+10)
#define RIGHT_LINE_A_LINE_12_Y_START RIGHT_LINE_A_LINE_11_Y_END
#define RIGHT_LINE_A_LINE_12_Y_END   (RIGHT_LINE_A_LINE_12_Y_START-1)

#define RIGHT_LINE_A_LINE_13_X_START (RIGHT_LINE_A_LINE_12_X_END -4)// modified
#define RIGHT_LINE_A_LINE_13_X_END   (RIGHT_LINE_A_LINE_13_X_START+6)
#define RIGHT_LINE_A_LINE_13_Y_START RIGHT_LINE_A_LINE_12_Y_END  //-->
#define RIGHT_LINE_A_LINE_13_Y_END   (RIGHT_LINE_A_LINE_13_Y_START-1)

#define RIGHT_LINE_A_LINE_14_X_START (RIGHT_LINE_A_LINE_13_X_END -2)// modified
#define RIGHT_LINE_A_LINE_14_X_END   (RIGHT_LINE_A_LINE_14_X_START+6)
#define RIGHT_LINE_A_LINE_14_Y_START RIGHT_LINE_A_LINE_13_Y_END      // modified
#define RIGHT_LINE_A_LINE_14_Y_END   (RIGHT_LINE_A_LINE_14_Y_START-1)

#define RIGHT_LINE_A_LINE_15_X_START (RIGHT_LINE_A_LINE_14_X_END -2)// modified
#define RIGHT_LINE_A_LINE_15_X_END   (RIGHT_LINE_A_LINE_15_X_START+6)
#define RIGHT_LINE_A_LINE_15_Y_START RIGHT_LINE_A_LINE_14_Y_END      // modified
#define RIGHT_LINE_A_LINE_15_Y_END   (RIGHT_LINE_A_LINE_15_Y_START-1)

#define RIGHT_LINE_A_LINE_16_X_START (RIGHT_LINE_A_LINE_15_X_END -2)
#define RIGHT_LINE_A_LINE_16_X_END   (RIGHT_LINE_A_LINE_16_X_START+6)
#define RIGHT_LINE_A_LINE_16_Y_START RIGHT_LINE_A_LINE_15_Y_END      // modified
#define RIGHT_LINE_A_LINE_16_Y_END   (RIGHT_LINE_A_LINE_16_Y_START-1)

#define RIGHT_LINE_A_LINE_17_X_START (RIGHT_LINE_A_LINE_16_X_END -2)
#define RIGHT_LINE_A_LINE_17_X_END   (RIGHT_LINE_A_LINE_17_X_START+6)
#define RIGHT_LINE_A_LINE_17_Y_START RIGHT_LINE_A_LINE_16_Y_END      // modified
#define RIGHT_LINE_A_LINE_17_Y_END   (RIGHT_LINE_A_LINE_17_Y_START-1 -1 -1)

#define RIGHT_LINE_A_LINE_18_X_START (RIGHT_LINE_A_LINE_17_X_END -2)
#define RIGHT_LINE_A_LINE_18_X_END   (RIGHT_LINE_A_LINE_18_X_START+6)
#define RIGHT_LINE_A_LINE_18_Y_START RIGHT_LINE_A_LINE_17_Y_END      // modified
#define RIGHT_LINE_A_LINE_18_Y_END   (RIGHT_LINE_A_LINE_18_Y_START-2 -1)

//#define RIGHT_LINE_A_LINE_18_X_START (RIGHT_LINE_A_LINE_17_X_END +2)  // modified
//#define RIGHT_LINE_A_LINE_18_X_END   (RIGHT_LINE_A_LINE_18_X_START-6)
//#define RIGHT_LINE_A_LINE_18_Y_START RIGHT_LINE_A_LINE_17_Y_END      // modified
//#define RIGHT_LINE_A_LINE_18_Y_END   (RIGHT_LINE_A_LINE_18_Y_START-2)

#define RIGHT_LINE_A_LINE_19_X_START (RIGHT_LINE_A_LINE_18_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_19_X_END   (RIGHT_LINE_A_LINE_19_X_START+6)
#define RIGHT_LINE_A_LINE_19_Y_START RIGHT_LINE_A_LINE_18_Y_END      // modified
#define RIGHT_LINE_A_LINE_19_Y_END   (RIGHT_LINE_A_LINE_19_Y_START-2 -1)

