dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
#define RIGHT_LINE_A_LINE_20_X_START (RIGHT_LINE_A_LINE_19_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_20_X_END   (RIGHT_LINE_A_LINE_20_X_START+6 -1)
#define RIGHT_LINE_A_LINE_20_Y_START RIGHT_LINE_A_LINE_19_Y_END      // modified
#define RIGHT_LINE_A_LINE_20_Y_END   (RIGHT_LINE_A_LINE_20_Y_START-3 -1)

#define RIGHT_LINE_A_LINE_21_X_START (RIGHT_LINE_A_LINE_20_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_21_X_END   (RIGHT_LINE_A_LINE_21_X_START+2)
#define RIGHT_LINE_A_LINE_21_Y_START RIGHT_LINE_A_LINE_20_Y_END + 1     // modified
#define RIGHT_LINE_A_LINE_21_Y_END   (RIGHT_LINE_A_LINE_21_Y_START-2)

#define RIGHT_LINE_A_LINE_22_X_START (RIGHT_LINE_A_LINE_21_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_22_X_END   (RIGHT_LINE_A_LINE_22_X_START+4 -1)
#define RIGHT_LINE_A_LINE_22_Y_START RIGHT_LINE_A_LINE_21_Y_END + 1     // modified
#define RIGHT_LINE_A_LINE_22_Y_END   (RIGHT_LINE_A_LINE_22_Y_START-2)

#define RIGHT_LINE_A_LINE_23_X_START (RIGHT_LINE_A_LINE_22_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_23_X_END   (RIGHT_LINE_A_LINE_23_X_START+4 -1)
#define RIGHT_LINE_A_LINE_23_Y_START RIGHT_LINE_A_LINE_22_Y_END + 5     // modified
#define RIGHT_LINE_A_LINE_23_Y_END   (RIGHT_LINE_A_LINE_23_Y_START-4 - 2)

#define RIGHT_LINE_A_LINE_24_X_START (RIGHT_LINE_A_LINE_23_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_24_X_END   (RIGHT_LINE_A_LINE_24_X_START+1)
#define RIGHT_LINE_A_LINE_24_Y_START RIGHT_LINE_A_LINE_23_Y_END + 1 + 1 + 3   // modified
#define RIGHT_LINE_A_LINE_24_Y_END   (RIGHT_LINE_A_LINE_24_Y_START-6)

#define RIGHT_LINE_A_LINE_25_X_START (RIGHT_LINE_A_LINE_24_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_25_X_END   (RIGHT_LINE_A_LINE_25_X_START+4 + 3 -1 -1 -1)
#define RIGHT_LINE_A_LINE_25_Y_START RIGHT_LINE_A_LINE_24_Y_END + 1  + 2     // modified
#define RIGHT_LINE_A_LINE_25_Y_END   (RIGHT_LINE_A_LINE_25_Y_START-7)

#define RIGHT_LINE_A_LINE_26_X_START (RIGHT_LINE_A_LINE_25_X_END -2)  // modified
#define RIGHT_LINE_A_LINE_26_X_END   (RIGHT_LINE_A_LINE_26_X_START+4)
#define RIGHT_LINE_A_LINE_26_Y_START RIGHT_LINE_A_LINE_25_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_26_Y_END   (RIGHT_LINE_A_LINE_26_Y_START-7)

#define RIGHT_LINE_A_LINE_27_X_START (RIGHT_LINE_A_LINE_26_X_END +1 -1)  // modified
#define RIGHT_LINE_A_LINE_27_X_END   (RIGHT_LINE_A_LINE_27_X_START+4 - 2)
#define RIGHT_LINE_A_LINE_27_Y_START RIGHT_LINE_A_LINE_26_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_27_Y_END   (RIGHT_LINE_A_LINE_27_Y_START-7)

#define RIGHT_LINE_A_LINE_28_X_START (RIGHT_LINE_A_LINE_27_X_END -3 +1)  // modified
#define RIGHT_LINE_A_LINE_28_X_END   (RIGHT_LINE_A_LINE_28_X_START+4 +1)
#define RIGHT_LINE_A_LINE_28_Y_START RIGHT_LINE_A_LINE_27_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_28_Y_END   (RIGHT_LINE_A_LINE_28_Y_START-11)

#define RIGHT_LINE_A_LINE_29_X_START (RIGHT_LINE_A_LINE_28_X_END )  // modified
#define RIGHT_LINE_A_LINE_29_X_END   (RIGHT_LINE_A_LINE_29_X_START+2 -1)
#define RIGHT_LINE_A_LINE_29_Y_START RIGHT_LINE_A_LINE_28_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_29_Y_END   (RIGHT_LINE_A_LINE_29_Y_START-11)

#define RIGHT_LINE_A_LINE_30_X_START (RIGHT_LINE_A_LINE_29_X_END )  // modified
#define RIGHT_LINE_A_LINE_30_X_END   (RIGHT_LINE_A_LINE_30_X_START+2 -1)
#define RIGHT_LINE_A_LINE_30_Y_START RIGHT_LINE_A_LINE_29_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_30_Y_END   (RIGHT_LINE_A_LINE_30_Y_START-11)

#define RIGHT_LINE_A_LINE_31_X_START (RIGHT_LINE_A_LINE_30_X_END )  // modified
#define RIGHT_LINE_A_LINE_31_X_END   (RIGHT_LINE_A_LINE_31_X_START+1)
#define RIGHT_LINE_A_LINE_31_Y_START RIGHT_LINE_A_LINE_30_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_31_Y_END   (RIGHT_LINE_A_LINE_31_Y_START-11)

#define RIGHT_LINE_A_LINE_32_X_START (RIGHT_LINE_A_LINE_31_X_END )  // modified
#define RIGHT_LINE_A_LINE_32_X_END   (RIGHT_LINE_A_LINE_32_X_START+2)
#define RIGHT_LINE_A_LINE_32_Y_START RIGHT_LINE_A_LINE_31_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_32_Y_END   (RIGHT_LINE_A_LINE_32_Y_START-11)

#define RIGHT_LINE_A_LINE_33_X_START (RIGHT_LINE_A_LINE_32_X_END )  // modified
#define RIGHT_LINE_A_LINE_33_X_END   (RIGHT_LINE_A_LINE_33_X_START+1)
#define RIGHT_LINE_A_LINE_33_Y_START RIGHT_LINE_A_LINE_32_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_33_Y_END   (RIGHT_LINE_A_LINE_33_Y_START-11)

#define RIGHT_LINE_A_LINE_34_X_START (RIGHT_LINE_A_LINE_33_X_END )  // modified
#define RIGHT_LINE_A_LINE_34_X_END   (RIGHT_LINE_A_LINE_34_X_START+2)
#define RIGHT_LINE_A_LINE_34_Y_START RIGHT_LINE_A_LINE_33_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_34_Y_END   (RIGHT_LINE_A_LINE_34_Y_START-11)

#define RIGHT_LINE_A_LINE_35_X_START (RIGHT_LINE_A_LINE_34_X_END )  // modified
#define RIGHT_LINE_A_LINE_35_X_END   (RIGHT_LINE_A_LINE_35_X_START+1)
#define RIGHT_LINE_A_LINE_35_Y_START RIGHT_LINE_A_LINE_34_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_35_Y_END   (RIGHT_LINE_A_LINE_35_Y_START-11)

#define RIGHT_LINE_A_LINE_36_X_START (RIGHT_LINE_A_LINE_35_X_END )  // modified
#define RIGHT_LINE_A_LINE_36_X_END   (RIGHT_LINE_A_LINE_36_X_START+2)
#define RIGHT_LINE_A_LINE_36_Y_START RIGHT_LINE_A_LINE_35_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_36_Y_END   (RIGHT_LINE_A_LINE_36_Y_START-11)

#define RIGHT_LINE_A_LINE_37_X_START (RIGHT_LINE_A_LINE_36_X_END )  // modified
#define RIGHT_LINE_A_LINE_37_X_END   (RIGHT_LINE_A_LINE_37_X_START+1)
#define RIGHT_LINE_A_LINE_37_Y_START RIGHT_LINE_A_LINE_36_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_37_Y_END   (RIGHT_LINE_A_LINE_37_Y_START-11)

#define RIGHT_LINE_A_LINE_38_X_START (RIGHT_LINE_A_LINE_37_X_END )  // modified
#define RIGHT_LINE_A_LINE_38_X_END   (RIGHT_LINE_A_LINE_38_X_START+1)
#define RIGHT_LINE_A_LINE_38_Y_START RIGHT_LINE_A_LINE_37_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_38_Y_END   (RIGHT_LINE_A_LINE_38_Y_START-11)

#define RIGHT_LINE_A_LINE_39_X_START (RIGHT_LINE_A_LINE_38_X_END )  // modified
#define RIGHT_LINE_A_LINE_39_X_END   (RIGHT_LINE_A_LINE_39_X_START+1)
#define RIGHT_LINE_A_LINE_39_Y_START RIGHT_LINE_A_LINE_38_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_39_Y_END   (RIGHT_LINE_A_LINE_39_Y_START-11)

#define RIGHT_LINE_A_LINE_40_X_START (RIGHT_LINE_A_LINE_39_X_END )  // modified
#define RIGHT_LINE_A_LINE_40_X_END   (RIGHT_LINE_A_LINE_40_X_START+2 )
#define RIGHT_LINE_A_LINE_40_Y_START RIGHT_LINE_A_LINE_39_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_40_Y_END   (RIGHT_LINE_A_LINE_40_Y_START-11)

