dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
#define RIGHT_LINE_A_LINE_41_X_START (RIGHT_LINE_A_LINE_40_X_END )  // modified
#define RIGHT_LINE_A_LINE_41_X_END   (RIGHT_LINE_A_LINE_41_X_START -1  -1 )
#define RIGHT_LINE_A_LINE_41_Y_START RIGHT_LINE_A_LINE_40_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_41_Y_END   (RIGHT_LINE_A_LINE_41_Y_START-11)

#define RIGHT_LINE_A_LINE_42_X_START (RIGHT_LINE_A_LINE_41_X_END +1 )  // modified
#define RIGHT_LINE_A_LINE_42_X_END   (RIGHT_LINE_A_LINE_42_X_START-1 -1 -1)
#define RIGHT_LINE_A_LINE_42_Y_START RIGHT_LINE_A_LINE_41_Y_END //+ 1  + 1     // modified
#define RIGHT_LINE_A_LINE_42_Y_END   (RIGHT_LINE_A_LINE_42_Y_START-11)

#define RIGHT_LINE_A_LINE_43_X_START (RIGHT_LINE_A_LINE_42_X_END )  // modified
#define RIGHT_LINE_A_LINE_43_X_END   (RIGHT_LINE_A_LINE_43_X_START-3 - 1 -1 -1 )
#define RIGHT_LINE_A_LINE_43_Y_START RIGHT_LINE_A_LINE_42_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_43_Y_END   (RIGHT_LINE_A_LINE_43_Y_START-11)

#define RIGHT_LINE_A_LINE_44_X_START (RIGHT_LINE_A_LINE_43_X_END )  // modified
#define RIGHT_LINE_A_LINE_44_X_END   (RIGHT_LINE_A_LINE_44_X_START-3 -1 -1 )
#define RIGHT_LINE_A_LINE_44_Y_START RIGHT_LINE_A_LINE_43_Y_END + 1  + 1     // modified
#define RIGHT_LINE_A_LINE_44_Y_END   (RIGHT_LINE_A_LINE_44_Y_START-6)

#define RIGHT_LINE_A_LINE_45_X_START (RIGHT_LINE_A_LINE_44_X_END +1 )  // modified
#define RIGHT_LINE_A_LINE_45_X_END   (RIGHT_LINE_A_LINE_45_X_START-4 -3 )
#define RIGHT_LINE_A_LINE_45_Y_START RIGHT_LINE_A_LINE_44_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_45_Y_END   (RIGHT_LINE_A_LINE_45_Y_START-6)

#define RIGHT_LINE_A_LINE_46_X_START (RIGHT_LINE_A_LINE_45_X_END +1 )  // modified
#define RIGHT_LINE_A_LINE_46_X_END   (RIGHT_LINE_A_LINE_46_X_START-4 -1)
#define RIGHT_LINE_A_LINE_46_Y_START RIGHT_LINE_A_LINE_45_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_46_Y_END   (RIGHT_LINE_A_LINE_46_Y_START-3)

#define RIGHT_LINE_A_LINE_47_X_START (RIGHT_LINE_A_LINE_46_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_47_X_END   (RIGHT_LINE_A_LINE_47_X_START-4 -2 -1)
#define RIGHT_LINE_A_LINE_47_Y_START RIGHT_LINE_A_LINE_46_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_47_Y_END   (RIGHT_LINE_A_LINE_47_Y_START-4)

#define RIGHT_LINE_A_LINE_48_X_START (RIGHT_LINE_A_LINE_47_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_48_X_END   (RIGHT_LINE_A_LINE_48_X_START-7 -1 )
#define RIGHT_LINE_A_LINE_48_Y_START RIGHT_LINE_A_LINE_47_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_48_Y_END   (RIGHT_LINE_A_LINE_48_Y_START-4)

#define RIGHT_LINE_A_LINE_49_X_START (RIGHT_LINE_A_LINE_48_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_49_X_END   (RIGHT_LINE_A_LINE_49_X_START-11 -3 -1 )
#define RIGHT_LINE_A_LINE_49_Y_START RIGHT_LINE_A_LINE_48_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_49_Y_END   (RIGHT_LINE_A_LINE_49_Y_START-7)

#define RIGHT_LINE_A_LINE_50_X_START (RIGHT_LINE_A_LINE_49_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_50_X_END   (RIGHT_LINE_A_LINE_50_X_START-11 )
#define RIGHT_LINE_A_LINE_50_Y_START RIGHT_LINE_A_LINE_49_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_50_Y_END   (RIGHT_LINE_A_LINE_50_Y_START-5)

#define RIGHT_LINE_A_LINE_51_X_START (RIGHT_LINE_A_LINE_50_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_51_X_END   (RIGHT_LINE_A_LINE_51_X_START-11-2 )
#define RIGHT_LINE_A_LINE_51_Y_START RIGHT_LINE_A_LINE_50_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_51_Y_END   (RIGHT_LINE_A_LINE_51_Y_START-5)

#define RIGHT_LINE_A_LINE_52_X_START (RIGHT_LINE_A_LINE_51_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_52_X_END   (RIGHT_LINE_A_LINE_52_X_START-11 -2)
#define RIGHT_LINE_A_LINE_52_Y_START RIGHT_LINE_A_LINE_51_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_52_Y_END   (RIGHT_LINE_A_LINE_52_Y_START-5)

#define RIGHT_LINE_A_LINE_53_X_START (RIGHT_LINE_A_LINE_52_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_53_X_END   (RIGHT_LINE_A_LINE_53_X_START-11 )
#define RIGHT_LINE_A_LINE_53_Y_START RIGHT_LINE_A_LINE_52_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_53_Y_END   (RIGHT_LINE_A_LINE_53_Y_START-3)

#define RIGHT_LINE_A_LINE_54_X_START (RIGHT_LINE_A_LINE_53_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_54_X_END   (RIGHT_LINE_A_LINE_54_X_START-11 )
#define RIGHT_LINE_A_LINE_54_Y_START RIGHT_LINE_A_LINE_53_Y_END       // modified
#define RIGHT_LINE_A_LINE_54_Y_END   (RIGHT_LINE_A_LINE_54_Y_START-4)

#define RIGHT_LINE_A_LINE_55_X_START (RIGHT_LINE_A_LINE_54_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_55_X_END   (RIGHT_LINE_A_LINE_55_X_START-11 )
#define RIGHT_LINE_A_LINE_55_Y_START RIGHT_LINE_A_LINE_54_Y_END + 1      // modified
#define RIGHT_LINE_A_LINE_55_Y_END   (RIGHT_LINE_A_LINE_55_Y_START-3)

#define RIGHT_LINE_A_LINE_56_X_START (RIGHT_LINE_A_LINE_55_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_56_X_END   (RIGHT_LINE_A_LINE_56_X_START-11 )
#define RIGHT_LINE_A_LINE_56_Y_START RIGHT_LINE_A_LINE_55_Y_END       // modified
#define RIGHT_LINE_A_LINE_56_Y_END   (RIGHT_LINE_A_LINE_56_Y_START-3)

#define RIGHT_LINE_A_LINE_57_X_START (RIGHT_LINE_A_LINE_56_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_57_X_END   (RIGHT_LINE_A_LINE_57_X_START-11 )
#define RIGHT_LINE_A_LINE_57_Y_START RIGHT_LINE_A_LINE_56_Y_END       // modified
#define RIGHT_LINE_A_LINE_57_Y_END   (RIGHT_LINE_A_LINE_57_Y_START-4)

#define RIGHT_LINE_A_LINE_58_X_START (RIGHT_LINE_A_LINE_57_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_58_X_END   (RIGHT_LINE_A_LINE_58_X_START-11 )
#define RIGHT_LINE_A_LINE_58_Y_START RIGHT_LINE_A_LINE_57_Y_END  +1     // modified
#define RIGHT_LINE_A_LINE_58_Y_END   (RIGHT_LINE_A_LINE_58_Y_START-3)

#define RIGHT_LINE_A_LINE_59_X_START (RIGHT_LINE_A_LINE_58_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_59_X_END   (RIGHT_LINE_A_LINE_59_X_START-11 )
#define RIGHT_LINE_A_LINE_59_Y_START RIGHT_LINE_A_LINE_58_Y_END       // modified
#define RIGHT_LINE_A_LINE_59_Y_END   (RIGHT_LINE_A_LINE_59_Y_START-4)

#define RIGHT_LINE_A_LINE_60_X_START (RIGHT_LINE_A_LINE_59_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_60_X_END   (RIGHT_LINE_A_LINE_60_X_START-11 )
#define RIGHT_LINE_A_LINE_60_Y_START RIGHT_LINE_A_LINE_59_Y_END  + 1     // modified
#define RIGHT_LINE_A_LINE_60_Y_END   (RIGHT_LINE_A_LINE_60_Y_START-3)

