dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
#define RIGHT_LINE_A_LINE_61_X_START (RIGHT_LINE_A_LINE_60_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_61_X_END   (RIGHT_LINE_A_LINE_61_X_START-11 )
#define RIGHT_LINE_A_LINE_61_Y_START RIGHT_LINE_A_LINE_60_Y_END       // modified
#define RIGHT_LINE_A_LINE_61_Y_END   (RIGHT_LINE_A_LINE_61_Y_START-3)

#define RIGHT_LINE_A_LINE_62_X_START (RIGHT_LINE_A_LINE_61_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_62_X_END   (RIGHT_LINE_A_LINE_62_X_START-11 )
#define RIGHT_LINE_A_LINE_62_Y_START RIGHT_LINE_A_LINE_61_Y_END       // modified
#define RIGHT_LINE_A_LINE_62_Y_END   (RIGHT_LINE_A_LINE_62_Y_START-4)

#define RIGHT_LINE_A_LINE_63_X_START (RIGHT_LINE_A_LINE_62_X_END +2 )  // modified
#define RIGHT_LINE_A_LINE_63_X_END   (RIGHT_LINE_A_LINE_63_X_START-11 )
#define RIGHT_LINE_A_LINE_63_Y_START RIGHT_LINE_A_LINE_62_Y_END  + 1     // modified
#define RIGHT_LINE_A_LINE_63_Y_END   (RIGHT_LINE_A_LINE_63_Y_START-4)

uint8_t right_draw_line_1_first_draw_forward = 1;
uint8_t right_draw_line_1_first_draw_forward_switch = 1;
uint8_t right_draw_line_1_draw_backward_switch = 0;
uint8_t right_draw_line_1_draw_backward_switch_case = 0;
uint8_t right_draw_line_1_draw_forward_switch = 0;
uint8_t right_draw_line_1_draw_forward_switch_case = 0;
uint8_t right_line_1_start_timer;
uint8_t right_line_1_start_timer_exp;

extern volatile uint32_t right_drawing_screen;
extern volatile uint32_t right_drawing_screen_inc_enable;
extern volatile uint8_t right_start_drawing;
//#define LEFT_DRAW_LINE_1_COLOR_RED 1

volatile uint8_t right_init_entry;

void right_draw_line_1(void)
{
//static lv_point_t line_points_R[] = { {214, 369}, {88, 357}};
//
//    /*Create style*/
//    static lv_style_t right_style_line;
//    lv_style_init(&right_style_line);
//    lv_style_set_line_width(&right_style_line, 12);
//    lv_style_set_line_color(&right_style_line, lv_palette_main(LV_PALETTE_RED));
//    lv_style_set_line_rounded(&right_style_line, false);
//
//    /*Create a line and apply the new style*/
//    lv_obj_t * line1;
//    line1 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//    lv_line_set_points(line1, line_points_R, 2);     /*Set the points*/
//    lv_obj_add_style(line1, &right_style_line, 0);
//    //lv_obj_center(line1);
	if(right_init_entry == 0)
	{
		right_line_1_start_timer = 1;
		right_line_1_start_timer_exp = 1;
		right_draw_line_1_first_draw_forward = 1;

		right_init_entry = 1;
	}
#ifndef RIGHT_DRAW_LINE_1_COLOR_RED
	lv_color_t right_first_line_color = LV_COLOR_MAKE(0,0,255);
#endif
	//lv_color_t right_last_line_color = LV_COLOR_MAKE(254,43,43);
	lv_color_t right_last_line_color = LV_COLOR_MAKE(168,16,31);
	//lv_color_t right_last_line_color = LV_COLOR_MAKE(255,85,85);
	//lv_color_t right_last_line_color = LV_COLOR_MAKE(255,0,0);

//	static lv_style_t right_right_style_line_L_11;
//	lv_style_init(&right_right_style_line_L_11);
//	lv_style_set_line_rounded(&right_right_style_line_L_11, false);

//	static lv_style_t right_style_line_L_fix;
//	lv_style_init(&right_style_line_L_fix);
//	lv_style_set_line_rounded(&right_style_line_L_fix, false);
//
//	static lv_style_t right_style_line_L_fix_temp;
//	lv_style_init(&right_style_line_L_fix_temp);
//	lv_style_set_line_rounded(&right_style_line_L_fix_temp, false);

	//right_draw_line_1_first_draw_forward_switch = 40;
	//while(1)
	if(right_start_drawing)
	{
		if(right_line_1_start_timer_exp)
		{
			//while(1)
			if(right_draw_line_1_first_draw_forward)
			{
				switch(right_draw_line_1_first_draw_forward_switch)
				{

				case 1 :
					;
					// Line - 1
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = -(10+1)
					// starting -- x = prev line ending (x +1)
					//static lv_point_t line_points_R[] = { {214, 369}, {203, 368}};
					static lv_point_t line_points_R[] = { {RIGHT_LINE_A_LINE_1_X_START, RIGHT_LINE_A_LINE_1_Y_START}, {RIGHT_LINE_A_LINE_1_X_END, RIGHT_LINE_A_LINE_1_Y_END}};
					//lv_color_t
					/*Create style*/
					static lv_style_t right_style_line;
					lv_style_init(&right_style_line);
					lv_style_set_line_width(&right_style_line, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line, 56);
					lv_style_set_line_color(&right_style_line, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line1;
					guider_ui.right_line1 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line1, line_points_R, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line1, &right_style_line, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 2 :
					;
					// Line - 2
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					//static lv_point_t right_right_line_points_L_1[] = { {204, 368}, {193, 367}};
					static lv_point_t right_right_line_points_L_1[] = { {RIGHT_LINE_A_LINE_2_X_START, RIGHT_LINE_A_LINE_2_Y_START}, {RIGHT_LINE_A_LINE_2_X_END, RIGHT_LINE_A_LINE_2_Y_END}};
					/*Create style*/
					static lv_style_t right_right_style_line_L_1;
					lv_style_init(&right_right_style_line_L_1);
					lv_style_set_line_width(&right_right_style_line_L_1, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_right_style_line_L_1, 56);
					lv_style_set_line_color(&right_right_style_line_L_1, right_first_line_color);
#else
					lv_style_set_line_color(&right_right_style_line_L_1, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_right_style_line_L_1, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line2;
					guider_ui.right_line2 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line2, right_right_line_points_L_1, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line2, &right_right_style_line_L_1, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 3 :
					;
					// Line - 3
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_right_line_points_L_2[] = { {RIGHT_LINE_A_LINE_3_X_START, RIGHT_LINE_A_LINE_3_Y_START}, {RIGHT_LINE_A_LINE_3_X_END, RIGHT_LINE_A_LINE_3_Y_END}};
					/*Create style*/
					static lv_style_t right_right_style_line_L_2;
					lv_style_init(&right_right_style_line_L_2);
					lv_style_set_line_width(&right_right_style_line_L_2, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					////lv_style_set_line_opa(&right_right_style_line_L_2, 56);
					lv_style_set_line_color(&right_right_style_line_L_2, right_first_line_color);
#else
					lv_style_set_line_color(&right_right_style_line_L_2, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_right_style_line_L_2, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line3;
					guider_ui.right_line3 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line3, right_right_line_points_L_2, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line3, &right_right_style_line_L_2, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

