dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
				case 4 :
					;
					// Line - 4
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_3[] = { {RIGHT_LINE_A_LINE_4_X_START, RIGHT_LINE_A_LINE_4_Y_START}, {RIGHT_LINE_A_LINE_4_X_END, RIGHT_LINE_A_LINE_4_Y_END}};
					/*Create style*/
					static lv_style_t right_style_line_L_3;
					lv_style_init(&right_style_line_L_3);
					lv_style_set_line_width(&right_style_line_L_3, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_3, 56);
					lv_style_set_line_color(&right_style_line_L_3, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_3, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line_L_3, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line4;
					guider_ui.right_line4 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line4, right_line_points_L_3, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line4, &right_style_line_L_3, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 5 :
					;
					// Line - 5
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_4[] = { {RIGHT_LINE_A_LINE_5_X_START, RIGHT_LINE_A_LINE_5_Y_START}, {RIGHT_LINE_A_LINE_5_X_END, RIGHT_LINE_A_LINE_5_Y_END}};
					/*Create style*/
					static lv_style_t right_style_line_L_4;
					lv_style_init(&right_style_line_L_4);
					lv_style_set_line_width(&right_style_line_L_4, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_4, 56);
					lv_style_set_line_color(&right_style_line_L_4, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_4, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line_L_4, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line5;
					guider_ui.right_line5 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line5, right_line_points_L_4, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line5, &right_style_line_L_4, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 6 :
					;
					// Line - 6
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_5[] = { {RIGHT_LINE_A_LINE_6_X_START, RIGHT_LINE_A_LINE_6_Y_START}, {RIGHT_LINE_A_LINE_6_X_END, RIGHT_LINE_A_LINE_6_Y_END}};
					/*Create style*/
					static lv_style_t right_style_line_L_5;
					lv_style_init(&right_style_line_L_5);
					lv_style_set_line_width(&right_style_line_L_5, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_5, 56);
					lv_style_set_line_color(&right_style_line_L_5, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_5, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line_L_5, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line6;
					guider_ui.right_line6 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line6, right_line_points_L_5, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line6, &right_style_line_L_5, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 7 :
					;
					// Line - 7
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_6[] = { {RIGHT_LINE_A_LINE_7_X_START, RIGHT_LINE_A_LINE_7_Y_START}, {RIGHT_LINE_A_LINE_7_X_END, RIGHT_LINE_A_LINE_7_Y_END}};
					/*Create style*/
					static lv_style_t right_style_line_L_6;
					lv_style_init(&right_style_line_L_6);
					lv_style_set_line_width(&right_style_line_L_6, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_6, 56);
					lv_style_set_line_color(&right_style_line_L_6, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_6, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line_L_6, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line7;
					guider_ui.right_line7 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line7, right_line_points_L_6, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line7, &right_style_line_L_6, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 8 :
					;
					// Line - 8
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_7[] = { {RIGHT_LINE_A_LINE_8_X_START, RIGHT_LINE_A_LINE_8_Y_START}, {RIGHT_LINE_A_LINE_8_X_END, RIGHT_LINE_A_LINE_8_Y_END}};
					/*Create style*/
					static lv_style_t right_style_line_L_7;
					lv_style_init(&right_style_line_L_7);
					lv_style_set_line_width(&right_style_line_L_7, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_7, 56);
					lv_style_set_line_color(&right_style_line_L_7, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_7, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line_L_7, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line8;
					guider_ui.right_line8 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line8, right_line_points_L_7, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line8, &right_style_line_L_7, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 9 :
					;
					// Line - 9
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_8[] = { {RIGHT_LINE_A_LINE_9_X_START, RIGHT_LINE_A_LINE_9_Y_START}, {RIGHT_LINE_A_LINE_9_X_END, RIGHT_LINE_A_LINE_9_Y_END}};
					/*Create style*/
					static lv_style_t right_style_line_L_8;
					lv_style_init(&right_style_line_L_8);
					lv_style_set_line_width(&right_style_line_L_8, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_8, 56);
					lv_style_set_line_color(&right_style_line_L_8, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_8, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line_L_8, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line9;
					guider_ui.right_line9 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line9, right_line_points_L_8, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line9, &right_style_line_L_8, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 10 :
					;
					// Line - 10
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_9[] = { {RIGHT_LINE_A_LINE_10_X_START, RIGHT_LINE_A_LINE_10_Y_START}, {RIGHT_LINE_A_LINE_10_X_END, RIGHT_LINE_A_LINE_10_Y_END}};
					/*Create style*/
					static lv_style_t right_style_line_L_9;
					lv_style_init(&right_style_line_L_9);
					lv_style_set_line_width(&right_style_line_L_9, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_9, 56);
					lv_style_set_line_color(&right_style_line_L_9, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_9, lv_palette_main(LV_PALETTE_RED));
#endif
					lv_style_set_line_rounded(&right_style_line_L_9, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line10;
					guider_ui.right_line10 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line10, right_line_points_L_9, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line10, &right_style_line_L_9, 0);
					//lv_obj_center(line1);
					//lv_task_handler();  // Update the display

