dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 11 :
					;
					// Line - 11
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_11[] = { {RIGHT_LINE_A_LINE_11_X_START, RIGHT_LINE_A_LINE_11_Y_START}, {RIGHT_LINE_A_LINE_11_X_END, RIGHT_LINE_A_LINE_11_Y_END}};
					/*Create style*/
//					static lv_style_t right_right_style_line_L_11;
//					lv_style_init(&right_right_style_line_L_11);
					static lv_style_t right_right_style_line_L_11;
					lv_style_init(&right_right_style_line_L_11);
					lv_style_set_line_rounded(&right_right_style_line_L_11, false);
					lv_style_set_line_width(&right_right_style_line_L_11, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_9, 56);
					lv_style_set_line_color(&right_right_style_line_L_11, right_first_line_color);
#else
					lv_style_set_line_color(&right_right_style_line_L_11, lv_palette_main(LV_PALETTE_RED));
#endif
					//lv_style_set_line_color(&right_right_style_line_L_11, lv_palette_main(LV_PALETTE_RED));
//					lv_style_set_line_rounded(&right_right_style_line_L_11, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line11;
					guider_ui.right_line11 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line11, right_line_points_L_11, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line11, &right_right_style_line_L_11, 0);
					//lv_obj_center(line1);
					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 12 :
					;
					// Line - 12
					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
					//12 lines : x = 128/12 = 10.66 = 10+1
					// starting -- x = prev line ending (x +1)
					static lv_point_t right_line_points_L_12[] = { {RIGHT_LINE_A_LINE_12_X_START, RIGHT_LINE_A_LINE_12_Y_START}, {RIGHT_LINE_A_LINE_12_X_END, RIGHT_LINE_A_LINE_12_Y_END}};
					/*Create style*/
//					static lv_style_t right_style_line_L_fix;
//					lv_style_init(&right_style_line_L_fix);
					static lv_style_t right_style_line_L_12;
					lv_style_init(&right_style_line_L_12);
					lv_style_set_line_rounded(&right_style_line_L_12, false);
					lv_style_set_line_width(&right_style_line_L_12, 12);
#ifndef LEFT_DRAW_LINE_1_COLOR_RED
					//lv_style_set_line_opa(&right_style_line_L_9, 56);
					lv_style_set_line_color(&right_style_line_L_12, right_first_line_color);
#else
					lv_style_set_line_color(&right_style_line_L_12, lv_palette_main(LV_PALETTE_RED));
#endif
//					lv_style_set_line_rounded(&right_style_line_L_fix, false);
					/*Create a line and apply the new style*/
					//lv_obj_t * line12;
					guider_ui.right_line12 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line12, right_line_points_L_12, 2);     /*Set the points*/
					lv_obj_add_style(guider_ui.right_line12, &right_style_line_L_12, 0);
					//lv_obj_center(line1);

					right_draw_line_1_first_draw_forward_switch++;
					break;

				case 13 :
					;
					static lv_point_t right_line_points_L_13[] = { {RIGHT_LINE_A_LINE_13_X_START, RIGHT_LINE_A_LINE_13_Y_START}, {RIGHT_LINE_A_LINE_13_X_END, RIGHT_LINE_A_LINE_13_Y_END}};
    				guider_ui.right_line13 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line13, right_line_points_L_13, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_13;
					lv_style_init(&right_style_line_L_13);
					lv_style_set_line_rounded(&right_style_line_L_13, true);
					lv_style_set_line_width(&right_style_line_L_13, 14);
					lv_style_set_line_color(&right_style_line_L_13, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line13, &right_style_line_L_13, 0);

	    			//lv_task_handler();  // Update the display

	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 14 :
					;

					static lv_point_t right_line_points_L_14[] = { {RIGHT_LINE_A_LINE_14_X_START, RIGHT_LINE_A_LINE_14_Y_START}, {RIGHT_LINE_A_LINE_14_X_END, RIGHT_LINE_A_LINE_14_Y_END}};
    				guider_ui.right_line14 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line14, right_line_points_L_14, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_14;
					lv_style_init(&right_style_line_L_14);
					lv_style_set_line_rounded(&right_style_line_L_14, true);
					lv_style_set_line_width(&right_style_line_L_14, 12);
					lv_style_set_line_color(&right_style_line_L_14, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line14, &right_style_line_L_14, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 15 :
					;
					static lv_point_t right_line_points_L_15[] = { {RIGHT_LINE_A_LINE_15_X_START, RIGHT_LINE_A_LINE_15_Y_START}, {RIGHT_LINE_A_LINE_15_X_END, RIGHT_LINE_A_LINE_15_Y_END}};
    				guider_ui.right_line15 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line15, right_line_points_L_15, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_15;
					lv_style_init(&right_style_line_L_15);
					lv_style_set_line_rounded(&right_style_line_L_15, true);
					lv_style_set_line_width(&right_style_line_L_15, 14);
					lv_style_set_line_color(&right_style_line_L_15, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line15, &right_style_line_L_15, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 16 :
					;
					static lv_point_t right_line_points_L_16[] = { {RIGHT_LINE_A_LINE_16_X_START, RIGHT_LINE_A_LINE_16_Y_START}, {RIGHT_LINE_A_LINE_16_X_END, RIGHT_LINE_A_LINE_16_Y_END}};
    				guider_ui.right_line16 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line16, right_line_points_L_16, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_16;
					lv_style_init(&right_style_line_L_16);
					lv_style_set_line_rounded(&right_style_line_L_16, true);
					lv_style_set_line_width(&right_style_line_L_16, 14);
					lv_style_set_line_color(&right_style_line_L_16, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line16, &right_style_line_L_16, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

