dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
				case 17 :
					;
					static lv_point_t right_line_points_L_17[] = { {RIGHT_LINE_A_LINE_17_X_START, RIGHT_LINE_A_LINE_17_Y_START}, {RIGHT_LINE_A_LINE_17_X_END, RIGHT_LINE_A_LINE_17_Y_END}};
    				guider_ui.right_line17 = lv_line_create(guider_ui.screen_drawing_container_drawing);
    				lv_line_set_points(guider_ui.right_line17, right_line_points_L_17, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_17;
					lv_style_init(&right_style_line_L_17);
					lv_style_set_line_rounded(&right_style_line_L_17, true);
					lv_style_set_line_width(&right_style_line_L_17, 14);
					lv_style_set_line_color(&right_style_line_L_17, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line17, &right_style_line_L_17, 0);

					//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 18 :
					;
					static lv_point_t right_line_points_L_18[] = { {RIGHT_LINE_A_LINE_18_X_START, RIGHT_LINE_A_LINE_18_Y_START}, {RIGHT_LINE_A_LINE_18_X_END, RIGHT_LINE_A_LINE_18_Y_END}};
    				guider_ui.right_line18 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line18, right_line_points_L_18, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_18;
					lv_style_init(&right_style_line_L_18);
					lv_style_set_line_rounded(&right_style_line_L_18, true);
					lv_style_set_line_width(&right_style_line_L_18, 14);
					lv_style_set_line_color(&right_style_line_L_18, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line18, &right_style_line_L_18, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 19 :
					;
					static lv_point_t right_line_points_L_19[] = { {RIGHT_LINE_A_LINE_19_X_START, RIGHT_LINE_A_LINE_19_Y_START}, {RIGHT_LINE_A_LINE_19_X_END, RIGHT_LINE_A_LINE_19_Y_END}};
    				guider_ui.right_line19 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line19, right_line_points_L_19, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_19;
					lv_style_init(&right_style_line_L_19);
					lv_style_set_line_rounded(&right_style_line_L_19, true);
					lv_style_set_line_width(&right_style_line_L_19, 14);
					lv_style_set_line_color(&right_style_line_L_19, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line19, &right_style_line_L_19, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 20 :
					;
					static lv_point_t right_line_points_L_20[] = { {RIGHT_LINE_A_LINE_20_X_START, RIGHT_LINE_A_LINE_20_Y_START}, {RIGHT_LINE_A_LINE_20_X_END, RIGHT_LINE_A_LINE_20_Y_END}};
    				guider_ui.right_line20 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line20, right_line_points_L_20, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_20;
					lv_style_init(&right_style_line_L_20);
					lv_style_set_line_rounded(&right_style_line_L_20, true);
					lv_style_set_line_width(&right_style_line_L_20, 14);
					lv_style_set_line_color(&right_style_line_L_20, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line20, &right_style_line_L_20, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 21 :
					;
					static lv_point_t right_line_points_L_21[] = { {RIGHT_LINE_A_LINE_21_X_START, RIGHT_LINE_A_LINE_21_Y_START}, {RIGHT_LINE_A_LINE_21_X_END, RIGHT_LINE_A_LINE_21_Y_END}};
    				guider_ui.right_line21 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line21, right_line_points_L_21, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_21;
					lv_style_init(&right_style_line_L_21);
					lv_style_set_line_rounded(&right_style_line_L_21, true);
					lv_style_set_line_width(&right_style_line_L_21, 14);
					lv_style_set_line_color(&right_style_line_L_21, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line21, &right_style_line_L_21, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 22 :
					;
	    			/// bunch
	    			static lv_point_t right_line_points_L_22[] = { {RIGHT_LINE_A_LINE_22_X_START, RIGHT_LINE_A_LINE_22_Y_START}, {RIGHT_LINE_A_LINE_22_X_END, RIGHT_LINE_A_LINE_22_Y_END}};
	    			guider_ui.right_line22 = lv_line_create(guider_ui.screen_drawing_container_drawing);
	    			lv_line_set_points(guider_ui.right_line22, right_line_points_L_22, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_22;
					lv_style_init(&right_style_line_L_22);
					lv_style_set_line_rounded(&right_style_line_L_22, true);
					lv_style_set_line_width(&right_style_line_L_22, 14);
					lv_style_set_line_color(&right_style_line_L_22, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line22, &right_style_line_L_22, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 23 :
					;
					static lv_point_t right_line_points_L_23[] = { {RIGHT_LINE_A_LINE_23_X_START, (RIGHT_LINE_A_LINE_23_Y_START-2)}, {RIGHT_LINE_A_LINE_23_X_END, RIGHT_LINE_A_LINE_23_Y_END}};
    				guider_ui.right_line23 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line23, right_line_points_L_23, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_23;
					lv_style_init(&right_style_line_L_23);
					lv_style_set_line_rounded(&right_style_line_L_23, true);
					lv_style_set_line_width(&right_style_line_L_23, 14);
					lv_style_set_line_color(&right_style_line_L_23, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line23, &right_style_line_L_23, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;

					break;

				case 24 :
					;
					static lv_point_t right_line_points_L_24[] = { {RIGHT_LINE_A_LINE_24_X_START, (RIGHT_LINE_A_LINE_24_Y_START-2)}, {RIGHT_LINE_A_LINE_24_X_END, RIGHT_LINE_A_LINE_24_Y_END}};
    				guider_ui.right_line24 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line24, right_line_points_L_24, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_24;
					lv_style_init(&right_style_line_L_24);
					lv_style_set_line_rounded(&right_style_line_L_24, true);
					lv_style_set_line_width(&right_style_line_L_24, 14);
					lv_style_set_line_color(&right_style_line_L_24, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line24, &right_style_line_L_24, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

