dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
				case 25 :
					;
					static lv_point_t right_line_points_L_25[] = { {RIGHT_LINE_A_LINE_25_X_START, RIGHT_LINE_A_LINE_25_Y_START}, {RIGHT_LINE_A_LINE_25_X_END, RIGHT_LINE_A_LINE_25_Y_END}};
    				guider_ui.right_line25 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line25, right_line_points_L_25, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_25;
					lv_style_init(&right_style_line_L_25);
					lv_style_set_line_rounded(&right_style_line_L_25, true);
					lv_style_set_line_width(&right_style_line_L_25, 14);
					lv_style_set_line_color(&right_style_line_L_25, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line25, &right_style_line_L_25, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 26 :
					;
					static lv_point_t right_line_points_L_26[] = { {RIGHT_LINE_A_LINE_26_X_START, RIGHT_LINE_A_LINE_26_Y_START}, {RIGHT_LINE_A_LINE_26_X_END, RIGHT_LINE_A_LINE_26_Y_END}};
    				guider_ui.right_line26 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line26, right_line_points_L_26, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_26;
					lv_style_init(&right_style_line_L_26);
					lv_style_set_line_rounded(&right_style_line_L_26, true);
					lv_style_set_line_width(&right_style_line_L_26, 14);
					lv_style_set_line_color(&right_style_line_L_26, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line26, &right_style_line_L_26, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

					//bunch
				case 27 :
					;

					static lv_point_t right_line_points_L_27[] = { {RIGHT_LINE_A_LINE_27_X_START, RIGHT_LINE_A_LINE_27_Y_START}, {RIGHT_LINE_A_LINE_27_X_END, RIGHT_LINE_A_LINE_27_Y_END}};
    				guider_ui.right_line27 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line27, right_line_points_L_27, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_27;
					lv_style_init(&right_style_line_L_27);
					lv_style_set_line_rounded(&right_style_line_L_27, true);
					lv_style_set_line_width(&right_style_line_L_27, 14);
					lv_style_set_line_color(&right_style_line_L_27, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line27, &right_style_line_L_27, 0);

	    			lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_28[] = { {RIGHT_LINE_A_LINE_28_X_START, RIGHT_LINE_A_LINE_28_Y_START}, {(RIGHT_LINE_A_LINE_28_X_END-1), RIGHT_LINE_A_LINE_28_Y_END}};
    				guider_ui.right_line28 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line28, right_line_points_L_28, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_28;
					lv_style_init(&right_style_line_L_28);
					lv_style_set_line_rounded(&right_style_line_L_28, true);
					lv_style_set_line_width(&right_style_line_L_28, 14);
					lv_style_set_line_color(&right_style_line_L_28, right_first_line_color);
	    			lv_obj_add_style(guider_ui.right_line28, &right_style_line_L_28, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 28 :
					;
					static lv_point_t right_line_points_L_29[] = { {(RIGHT_LINE_A_LINE_29_X_START -1), RIGHT_LINE_A_LINE_29_Y_START}, {(RIGHT_LINE_A_LINE_29_X_END-1), RIGHT_LINE_A_LINE_29_Y_END}};
    				guider_ui.right_line29 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line29, right_line_points_L_29, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_29;
					lv_style_init(&right_style_line_L_29);
					lv_style_set_line_width(&right_style_line_L_29, 14);
					lv_style_set_line_color(&right_style_line_L_29, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_29, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line29, &right_style_line_L_29, 0);

	    			lv_task_handler();  // Update the display


					static lv_point_t right_line_points_L_30[] = { {RIGHT_LINE_A_LINE_30_X_START, RIGHT_LINE_A_LINE_30_Y_START}, {RIGHT_LINE_A_LINE_30_X_END, RIGHT_LINE_A_LINE_30_Y_END}};
    				guider_ui.right_line30 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line30, right_line_points_L_30, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_30;
					lv_style_init(&right_style_line_L_30);
					lv_style_set_line_width(&right_style_line_L_30, 15);
					lv_style_set_line_color(&right_style_line_L_30, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_30, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line30, &right_style_line_L_30, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 29 :
					;

					static lv_point_t right_line_points_L_31[] = { {RIGHT_LINE_A_LINE_31_X_START, RIGHT_LINE_A_LINE_31_Y_START}, {RIGHT_LINE_A_LINE_31_X_END, RIGHT_LINE_A_LINE_31_Y_END}};
    				guider_ui.right_line31 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line31, right_line_points_L_31, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_31;
					lv_style_init(&right_style_line_L_31);
					lv_style_set_line_width(&right_style_line_L_31, 15);
					lv_style_set_line_color(&right_style_line_L_31, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_31, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line31, &right_style_line_L_31, 0);

	    			//lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_32[] = { {RIGHT_LINE_A_LINE_32_X_START, RIGHT_LINE_A_LINE_32_Y_START}, {RIGHT_LINE_A_LINE_32_X_END, RIGHT_LINE_A_LINE_32_Y_END}};
    				guider_ui.right_line32 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line32, right_line_points_L_32, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_32;
					lv_style_init(&right_style_line_L_32);
					lv_style_set_line_width(&right_style_line_L_32, 15);
					lv_style_set_line_color(&right_style_line_L_32, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_32, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line32, &right_style_line_L_32, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 30 :
					;
					static lv_point_t right_line_points_L_33[] = { {RIGHT_LINE_A_LINE_33_X_START, RIGHT_LINE_A_LINE_33_Y_START}, {RIGHT_LINE_A_LINE_33_X_END, RIGHT_LINE_A_LINE_33_Y_END}};
    				guider_ui.right_line33 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line33, right_line_points_L_33, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_33;
					lv_style_init(&right_style_line_L_33);
					lv_style_set_line_width(&right_style_line_L_33, 15);
					lv_style_set_line_color(&right_style_line_L_33, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_33, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line33, &right_style_line_L_33, 0);

	    			//lv_task_handler();  // Update the display

