dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
					static lv_point_t right_line_points_L_34[] = { {RIGHT_LINE_A_LINE_34_X_START, RIGHT_LINE_A_LINE_34_Y_START}, {RIGHT_LINE_A_LINE_34_X_END, RIGHT_LINE_A_LINE_34_Y_END}};
    				guider_ui.right_line34 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line34, right_line_points_L_34, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_34;
					lv_style_init(&right_style_line_L_34);
					lv_style_set_line_width(&right_style_line_L_34, 15);
					lv_style_set_line_color(&right_style_line_L_34, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_34, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line34, &right_style_line_L_34, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 31 :
					;
					static lv_point_t right_line_points_L_35[] = { {RIGHT_LINE_A_LINE_35_X_START, RIGHT_LINE_A_LINE_35_Y_START}, {RIGHT_LINE_A_LINE_35_X_END, RIGHT_LINE_A_LINE_35_Y_END}};
    				guider_ui.right_line35 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line35, right_line_points_L_35, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_35;
					lv_style_init(&right_style_line_L_35);
					lv_style_set_line_width(&right_style_line_L_35, 15);
					lv_style_set_line_color(&right_style_line_L_35, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_35, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line35, &right_style_line_L_35, 0);

	    			//lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_36[] = { {RIGHT_LINE_A_LINE_36_X_START, RIGHT_LINE_A_LINE_36_Y_START}, {RIGHT_LINE_A_LINE_36_X_END, RIGHT_LINE_A_LINE_36_Y_END}};
    				guider_ui.right_line36 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line36, right_line_points_L_36, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_36;
					lv_style_init(&right_style_line_L_36);
					lv_style_set_line_width(&right_style_line_L_36, 15);
					lv_style_set_line_color(&right_style_line_L_36, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_36, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line36, &right_style_line_L_36, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 32 :
					;
					static lv_point_t right_line_points_L_37[] = { {RIGHT_LINE_A_LINE_37_X_START, RIGHT_LINE_A_LINE_37_Y_START}, {RIGHT_LINE_A_LINE_37_X_END, RIGHT_LINE_A_LINE_37_Y_END}};
    				guider_ui.right_line37 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line37, right_line_points_L_37, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_37;
					lv_style_init(&right_style_line_L_37);
					lv_style_set_line_width(&right_style_line_L_37, 15);
					lv_style_set_line_color(&right_style_line_L_37, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_37, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line37, &right_style_line_L_37, 0);

	    			lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_38[] = { {RIGHT_LINE_A_LINE_38_X_START, RIGHT_LINE_A_LINE_38_Y_START}, {RIGHT_LINE_A_LINE_38_X_END, RIGHT_LINE_A_LINE_38_Y_END}};
    				guider_ui.right_line38 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line38, right_line_points_L_38, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_38;
					lv_style_init(&right_style_line_L_38);
					lv_style_set_line_width(&right_style_line_L_38, 15);
					lv_style_set_line_color(&right_style_line_L_38, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_38, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line38, &right_style_line_L_38, 0);

	    			lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 33 :
					;
					static lv_point_t right_line_points_L_39[] = { {RIGHT_LINE_A_LINE_39_X_START, RIGHT_LINE_A_LINE_39_Y_START}, {RIGHT_LINE_A_LINE_39_X_END, RIGHT_LINE_A_LINE_39_Y_END}};
    				guider_ui.right_line39 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line39, right_line_points_L_39, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_39;
					lv_style_init(&right_style_line_L_39);
					lv_style_set_line_width(&right_style_line_L_39, 15);
					lv_style_set_line_color(&right_style_line_L_39, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_39, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line39, &right_style_line_L_39, 0);

	    			lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_40[] = { {RIGHT_LINE_A_LINE_40_X_START, RIGHT_LINE_A_LINE_40_Y_START}, {RIGHT_LINE_A_LINE_40_X_END, RIGHT_LINE_A_LINE_40_Y_END}};
    				guider_ui.right_line40 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line40, right_line_points_L_40, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_40;
					lv_style_init(&right_style_line_L_40);
					lv_style_set_line_width(&right_style_line_L_40, 17);
					lv_style_set_line_color(&right_style_line_L_40, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_40, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line40, &right_style_line_L_40, 0);

	    			lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 34 :
					;
					static lv_point_t right_line_points_L_41[] = { {RIGHT_LINE_A_LINE_41_X_START, RIGHT_LINE_A_LINE_41_Y_START}, {RIGHT_LINE_A_LINE_41_X_END, RIGHT_LINE_A_LINE_41_Y_END}};
    				guider_ui.right_line41 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line41, right_line_points_L_41, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_41;
					lv_style_init(&right_style_line_L_41);
					lv_style_set_line_width(&right_style_line_L_41, 17);
					lv_style_set_line_color(&right_style_line_L_41, right_first_line_color);
					lv_style_set_line_rounded(&right_style_line_L_41, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line41, &right_style_line_L_41, 0);

	    			//lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_42[] = { {RIGHT_LINE_A_LINE_42_X_START, RIGHT_LINE_A_LINE_42_Y_START}, {RIGHT_LINE_A_LINE_42_X_END, RIGHT_LINE_A_LINE_42_Y_END}};
    				guider_ui.right_line42 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line42, right_line_points_L_42, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_42;
					lv_style_init(&right_style_line_L_42);
					lv_style_set_line_width(&right_style_line_L_42, 17);
					lv_style_set_line_color(&right_style_line_L_42, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_42, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line42, &right_style_line_L_42, 0);

