dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
	    			lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 35 :
					;
					static lv_point_t right_line_points_L_43[] = { {RIGHT_LINE_A_LINE_43_X_START, RIGHT_LINE_A_LINE_43_Y_START}, {RIGHT_LINE_A_LINE_43_X_END, RIGHT_LINE_A_LINE_43_Y_END}};
    				guider_ui.right_line43 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line43, right_line_points_L_43, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_43;
					lv_style_init(&right_style_line_L_43);
					lv_style_set_line_width(&right_style_line_L_43, 16);
					lv_style_set_line_color(&right_style_line_L_43, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_43, true); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line43, &right_style_line_L_43, 0);


					static lv_point_t right_line_points_L_44[] = { {RIGHT_LINE_A_LINE_44_X_START, RIGHT_LINE_A_LINE_44_Y_START}, {RIGHT_LINE_A_LINE_44_X_END, RIGHT_LINE_A_LINE_44_Y_END}};
    				guider_ui.right_line44 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line44, right_line_points_L_44, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_44;
					lv_style_init(&right_style_line_L_44);
					lv_style_set_line_width(&right_style_line_L_44, 16);
					lv_style_set_line_color(&right_style_line_L_44, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_44, true); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line44, &right_style_line_L_44, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 36 :
					;
					static lv_point_t right_line_points_L_45[] = { {RIGHT_LINE_A_LINE_45_X_START, RIGHT_LINE_A_LINE_45_Y_START}, {RIGHT_LINE_A_LINE_45_X_END, RIGHT_LINE_A_LINE_45_Y_END}};
    				guider_ui.right_line45 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line45, right_line_points_L_45, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_45;
					lv_style_init(&right_style_line_L_45);
					lv_style_set_line_width(&right_style_line_L_45, 16);
					lv_style_set_line_color(&right_style_line_L_45, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_45, true); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line45, &right_style_line_L_45, 0);

	    			lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_46[] = { {RIGHT_LINE_A_LINE_46_X_START, RIGHT_LINE_A_LINE_46_Y_START}, {RIGHT_LINE_A_LINE_46_X_END, RIGHT_LINE_A_LINE_46_Y_END}};
    				guider_ui.right_line46 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line46, right_line_points_L_46, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_46;
					lv_style_init(&right_style_line_L_46);
					lv_style_set_line_width(&right_style_line_L_46, 15);
					lv_style_set_line_color(&right_style_line_L_46, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_46, true); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line46, &right_style_line_L_46, 0);

	    			lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 37:
					;
					static lv_point_t right_line_points_L_47[] = { {RIGHT_LINE_A_LINE_47_X_START, RIGHT_LINE_A_LINE_47_Y_START}, {RIGHT_LINE_A_LINE_47_X_END, RIGHT_LINE_A_LINE_47_Y_END}};
    				guider_ui.right_line47 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line47, right_line_points_L_47, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_47;
					lv_style_init(&right_style_line_L_47);
					lv_style_set_line_width(&right_style_line_L_47, 15);
					lv_style_set_line_color(&right_style_line_L_47, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_47, true); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line47, &right_style_line_L_47, 0);

	    			lv_task_handler();  // Update the display
//	    			right_draw_line_1_first_draw_forward_switch = 88;
//	    			break;

					static lv_point_t right_line_points_L_48[] = { {RIGHT_LINE_A_LINE_48_X_START, RIGHT_LINE_A_LINE_48_Y_START}, {RIGHT_LINE_A_LINE_48_X_END, RIGHT_LINE_A_LINE_48_Y_END}};
    				guider_ui.right_line48 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line48, right_line_points_L_48, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_48;
					lv_style_init(&right_style_line_L_48);
					lv_style_set_line_width(&right_style_line_L_48, 14);
					lv_style_set_line_color(&right_style_line_L_48, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_48, true); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line48, &right_style_line_L_48, 0);

	    			lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
//	    			right_draw_line_1_first_draw_forward_switch = 88;
					break;

				case 38 :
					;
					static lv_point_t right_line_points_L_49[] = { {RIGHT_LINE_A_LINE_49_X_START, RIGHT_LINE_A_LINE_49_Y_START}, {RIGHT_LINE_A_LINE_49_X_END, RIGHT_LINE_A_LINE_49_Y_END}};
    				guider_ui.right_line49 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line49, right_line_points_L_49, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_49;
					lv_style_init(&right_style_line_L_49);
					lv_style_set_line_width(&right_style_line_L_49, 14);
					lv_style_set_line_color(&right_style_line_L_49, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_49, true); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line49, &right_style_line_L_49, 0);

