dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
	    			lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_50[] = { {RIGHT_LINE_A_LINE_50_X_START, RIGHT_LINE_A_LINE_50_Y_START}, {RIGHT_LINE_A_LINE_50_X_END, RIGHT_LINE_A_LINE_50_Y_END}};
    				guider_ui.right_line50 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line50, right_line_points_L_50, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_50;
					lv_style_init(&right_style_line_L_50);
					lv_style_set_line_width(&right_style_line_L_50, 14);
					lv_style_set_line_color(&right_style_line_L_50, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_50, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line50, &right_style_line_L_50, 0);

	    			lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
	    			//right_draw_line_1_first_draw_forward_switch = 88;
					break;

				case 39 :
					;
					static lv_point_t right_line_points_L_51[] = { {RIGHT_LINE_A_LINE_51_X_START, RIGHT_LINE_A_LINE_51_Y_START}, {RIGHT_LINE_A_LINE_51_X_END, RIGHT_LINE_A_LINE_51_Y_END}};
    				guider_ui.right_line51 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line51, right_line_points_L_51, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_51;
					lv_style_init(&right_style_line_L_51);
					lv_style_set_line_width(&right_style_line_L_51, 14);
					lv_style_set_line_color(&right_style_line_L_51, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_51, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line51, &right_style_line_L_51, 0);

	    			//lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_52[] = { {RIGHT_LINE_A_LINE_52_X_START, RIGHT_LINE_A_LINE_52_Y_START}, {RIGHT_LINE_A_LINE_52_X_END, RIGHT_LINE_A_LINE_52_Y_END}};
    				guider_ui.right_line52 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line52, right_line_points_L_52, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_52;
					lv_style_init(&right_style_line_L_52);
					lv_style_set_line_width(&right_style_line_L_52, 14);
					lv_style_set_line_color(&right_style_line_L_52, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_52, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line52, &right_style_line_L_52, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
	    			//right_draw_line_1_first_draw_forward_switch = 88;
					break;

				case 40 :
					;
					static lv_point_t right_line_points_L_53[] = { {RIGHT_LINE_A_LINE_53_X_START, RIGHT_LINE_A_LINE_53_Y_START}, {RIGHT_LINE_A_LINE_53_X_END, RIGHT_LINE_A_LINE_53_Y_END}};
    				guider_ui.right_line53 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line53, right_line_points_L_53, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_53;
					lv_style_init(&right_style_line_L_53);
					lv_style_set_line_width(&right_style_line_L_53, 14);
					lv_style_set_line_color(&right_style_line_L_53, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_53, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line53, &right_style_line_L_53, 0);

	    			//lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_54[] = { {RIGHT_LINE_A_LINE_54_X_START, RIGHT_LINE_A_LINE_54_Y_START}, {RIGHT_LINE_A_LINE_54_X_END, RIGHT_LINE_A_LINE_54_Y_END}};
    				guider_ui.right_line54 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line54, right_line_points_L_54, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_54;
					lv_style_init(&right_style_line_L_54);
					lv_style_set_line_width(&right_style_line_L_54, 14);
					lv_style_set_line_color(&right_style_line_L_54, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_54, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line54, &right_style_line_L_54, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 41 :
					;
					static lv_point_t right_line_points_L_55[] = { {RIGHT_LINE_A_LINE_55_X_START, RIGHT_LINE_A_LINE_55_Y_START}, {RIGHT_LINE_A_LINE_55_X_END, RIGHT_LINE_A_LINE_55_Y_END}};
    				guider_ui.right_line55 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line55, right_line_points_L_55, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_55;
					lv_style_init(&right_style_line_L_55);
					lv_style_set_line_width(&right_style_line_L_55, 14);
					lv_style_set_line_color(&right_style_line_L_55, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_55, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line55, &right_style_line_L_55, 0);

	    			//lv_task_handler();  // Update the display

					static lv_point_t right_line_points_L_56[] = { {RIGHT_LINE_A_LINE_56_X_START, RIGHT_LINE_A_LINE_56_Y_START}, {RIGHT_LINE_A_LINE_56_X_END, RIGHT_LINE_A_LINE_56_Y_END}};
    				guider_ui.right_line56 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line56, right_line_points_L_56, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_56;
					lv_style_init(&right_style_line_L_56);
					lv_style_set_line_width(&right_style_line_L_56, 14);
					lv_style_set_line_color(&right_style_line_L_56, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_56, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line56, &right_style_line_L_56, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
	    			//right_draw_line_1_first_draw_forward_switch = 88;
					break;

				case 42 :
					;
					static lv_point_t right_line_points_L_57[] = { {RIGHT_LINE_A_LINE_57_X_START, RIGHT_LINE_A_LINE_57_Y_START}, {RIGHT_LINE_A_LINE_57_X_END, RIGHT_LINE_A_LINE_57_Y_END}};
    				guider_ui.right_line57 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line57, right_line_points_L_57, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_57;
					lv_style_init(&right_style_line_L_57);
					lv_style_set_line_width(&right_style_line_L_57, 14);
					lv_style_set_line_color(&right_style_line_L_57, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_57, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line57, &right_style_line_L_57, 0);

	    			//lv_task_handler();  // Update the display

