dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
					static lv_point_t right_line_points_L_58[] = { {RIGHT_LINE_A_LINE_58_X_START, RIGHT_LINE_A_LINE_58_Y_START}, {RIGHT_LINE_A_LINE_58_X_END, RIGHT_LINE_A_LINE_58_Y_END}};
    				guider_ui.right_line58 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line58, right_line_points_L_58, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_58;
					lv_style_init(&right_style_line_L_58);
					lv_style_set_line_width(&right_style_line_L_58, 14);
					lv_style_set_line_color(&right_style_line_L_58, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_58, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line58, &right_style_line_L_58, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 43 :
					;
					static lv_point_t right_line_points_L_59[] = { {RIGHT_LINE_A_LINE_59_X_START, RIGHT_LINE_A_LINE_59_Y_START}, {RIGHT_LINE_A_LINE_59_X_END, RIGHT_LINE_A_LINE_59_Y_END}};
    				guider_ui.right_line59 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line59, right_line_points_L_59, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_59;
					lv_style_init(&right_style_line_L_59);
					lv_style_set_line_width(&right_style_line_L_59, 14);
					lv_style_set_line_color(&right_style_line_L_59, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_59, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line59, &right_style_line_L_59, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
//	    			right_draw_line_1_first_draw_forward_switch = 88;
					break;

				case 44 :
					;
					static lv_point_t right_line_points_L_60[] = { {RIGHT_LINE_A_LINE_60_X_START, RIGHT_LINE_A_LINE_60_Y_START}, {RIGHT_LINE_A_LINE_60_X_END, RIGHT_LINE_A_LINE_60_Y_END}};
    				guider_ui.right_line60 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line60, right_line_points_L_60, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_60;
					lv_style_init(&right_style_line_L_60);
					lv_style_set_line_width(&right_style_line_L_60, 14);
					lv_style_set_line_color(&right_style_line_L_60, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_60, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line60, &right_style_line_L_60, 0);

	    			//lv_task_handler();  // Update the display
	    			right_draw_line_1_first_draw_forward_switch++;
					break;

				case 45 :
					;
					static lv_point_t right_line_points_L_61[] = { {RIGHT_LINE_A_LINE_61_X_START, RIGHT_LINE_A_LINE_61_Y_START}, {RIGHT_LINE_A_LINE_61_X_END, RIGHT_LINE_A_LINE_61_Y_END}};
    				guider_ui.right_line61 = lv_line_create(guider_ui.screen_drawing_container_drawing);
					lv_line_set_points(guider_ui.right_line61, right_line_points_L_61, 2);     /*Set the points*/
					static lv_style_t right_style_line_L_61;
					lv_style_init(&right_style_line_L_61);
					lv_style_set_line_width(&right_style_line_L_61, 14);
					lv_style_set_line_color(&right_style_line_L_61, right_last_line_color);
					lv_style_set_line_rounded(&right_style_line_L_61, false); // rectangle false
	    			lv_obj_add_style(guider_ui.right_line61, &right_style_line_L_61, 0);

	    			//lv_task_handler();  // Update the display
	    			//right_draw_line_1_first_draw_forward_switch++;
	    			//final
	    			// first time draw completed
	    			right_draw_line_1_first_draw_forward_switch=0;
	    			right_draw_line_1_first_draw_forward = 0;
	    			right_draw_line_1_draw_backward_switch = 1;
					break;

//				case 46 :
//					;
//					static lv_point_t right_line_points_L_62[] = { {RIGHT_LINE_A_LINE_62_X_START, RIGHT_LINE_A_LINE_62_Y_START}, {RIGHT_LINE_A_LINE_62_X_END, RIGHT_LINE_A_LINE_62_Y_END}};
//    				guider_ui.right_line62 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.right_line62, right_line_points_L_62, 2);     /*Set the points*/
//					static lv_style_t right_style_line_L_62;
//					lv_style_init(&right_style_line_L_62);
//					lv_style_set_line_width(&right_style_line_L_62, 14);
//					lv_style_set_line_color(&right_style_line_L_62, right_last_line_color);
//					lv_style_set_line_rounded(&right_style_line_L_62, false); // rectangle false
//	    			lv_obj_add_style(guider_ui.right_line62, &right_style_line_L_62, 0);
//
//	    			//lv_task_handler();  // Update the display
//	    			right_draw_line_1_first_draw_forward_switch++;
//	    			//right_draw_line_1_first_draw_forward_switch = 88;
//					break;
//
//				case 47 :
//					;
//					static lv_point_t right_line_points_L_63[] = { {RIGHT_LINE_A_LINE_63_X_START, RIGHT_LINE_A_LINE_63_Y_START}, {RIGHT_LINE_A_LINE_63_X_END, RIGHT_LINE_A_LINE_63_Y_END}};
//    				guider_ui.right_line63 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.right_line63, right_line_points_L_63, 2);     /*Set the points*/
//					static lv_style_t right_style_line_L_63;
//					lv_style_init(&right_style_line_L_63);
//					lv_style_set_line_width(&right_style_line_L_63, 14);
//					lv_style_set_line_color(&right_style_line_L_63, right_last_line_color);
//					lv_style_set_line_rounded(&right_style_line_L_63, false); // rectangle false
//	    			lv_obj_add_style(guider_ui.right_line63, &right_style_line_L_63, 0);
//
//	    			//lv_task_handler();  // Update the display
//
//	    			//final
//	    			// first time draw completed
//	    			right_draw_line_1_first_draw_forward_switch=0;
//	    			right_draw_line_1_first_draw_forward = 0;
//	    			right_draw_line_1_draw_backward_switch = 1;
//					break;

				default :
					break;
				}

				lv_task_handler();  // Update the display
			}
			else
			{
				if(right_draw_line_1_draw_backward_switch)
				{
					switch (right_draw_line_1_draw_backward_switch_case)
					{
//					case 0 :
//						lv_obj_add_flag(guider_ui.right_line63, LV_OBJ_FLAG_HIDDEN);
//						right_draw_line_1_draw_backward_switch_case++;
//						break;
//					case 1 :
//						lv_obj_add_flag(guider_ui.right_line62, LV_OBJ_FLAG_HIDDEN);
//						right_draw_line_1_draw_backward_switch_case++;
//						break;
					case 0 :
						lv_obj_add_flag(guider_ui.right_line61, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 1 :
						lv_obj_add_flag(guider_ui.right_line60, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 2 :
						lv_obj_add_flag(guider_ui.right_line59, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 3 :
						lv_obj_add_flag(guider_ui.right_line58, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line57, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 4 :
						lv_obj_add_flag(guider_ui.right_line56, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line55, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 5 :
						lv_obj_add_flag(guider_ui.right_line54, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line53, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 6 :
						lv_obj_add_flag(guider_ui.right_line52, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line51, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 7 :
						lv_obj_add_flag(guider_ui.right_line50, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line49, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 8 :
						lv_obj_add_flag(guider_ui.right_line48, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line47, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 9 :
						lv_obj_add_flag(guider_ui.right_line46, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line45, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 10 :
						lv_obj_add_flag(guider_ui.right_line44, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line43, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 11 :
						lv_obj_add_flag(guider_ui.right_line42, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line41, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 12 :
						lv_obj_add_flag(guider_ui.right_line40, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line39, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 13 :
						lv_obj_add_flag(guider_ui.right_line38, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line37, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 14 :
						lv_obj_add_flag(guider_ui.right_line36, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line35, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 15 :
						lv_obj_add_flag(guider_ui.right_line34, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line33, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 16 :
						lv_obj_add_flag(guider_ui.right_line32, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line31, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 17 :
						lv_obj_add_flag(guider_ui.right_line30, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line29, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 18 :
						lv_obj_add_flag(guider_ui.right_line28, LV_OBJ_FLAG_HIDDEN);
						lv_obj_add_flag(guider_ui.right_line27, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 19 :
						lv_obj_add_flag(guider_ui.right_line26, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 20 :
						lv_obj_add_flag(guider_ui.right_line25, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 21 :
						lv_obj_add_flag(guider_ui.right_line24, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 22 :
						lv_obj_add_flag(guider_ui.right_line23, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 23 :
						lv_obj_add_flag(guider_ui.right_line22, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 24 :
						lv_obj_add_flag(guider_ui.right_line21, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 25 :
						lv_obj_add_flag(guider_ui.right_line20, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 26 :
						lv_obj_add_flag(guider_ui.right_line19, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 27 :
						lv_obj_add_flag(guider_ui.right_line18, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 28 :
						lv_obj_add_flag(guider_ui.right_line17, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 29 :
						lv_obj_add_flag(guider_ui.right_line16, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 30 :
						lv_obj_add_flag(guider_ui.right_line15, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 31 :
						lv_obj_add_flag(guider_ui.right_line14, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 32 :
						lv_obj_add_flag(guider_ui.right_line13, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 33 :
						lv_obj_add_flag(guider_ui.right_line12, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 34 :
						lv_obj_add_flag(guider_ui.right_line11, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 35 :
						lv_obj_add_flag(guider_ui.right_line10, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 36 :
						lv_obj_add_flag(guider_ui.right_line9, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 37 :
						lv_obj_add_flag(guider_ui.right_line8, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 38 :
						lv_obj_add_flag(guider_ui.right_line7, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 39 :
						lv_obj_add_flag(guider_ui.right_line6, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 40 :
						lv_obj_add_flag(guider_ui.right_line5, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 41 :
						lv_obj_add_flag(guider_ui.right_line4, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 42 :
						lv_obj_add_flag(guider_ui.right_line3, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 43 :
						lv_obj_add_flag(guider_ui.right_line2, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;
						break;
					case 44 :
						lv_obj_add_flag(guider_ui.right_line1, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_backward_switch_case++;

						right_draw_line_1_draw_backward_switch_case=0;
						right_draw_line_1_draw_backward_switch = 0;
						right_draw_line_1_draw_forward_switch = 1;
						right_draw_line_1_draw_forward_switch_case = 0;
						break;
					default:
						break;
					}

