dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/right_place_draw.c
				}
				else if (right_draw_line_1_draw_forward_switch)
				{
					switch (right_draw_line_1_draw_forward_switch_case)
					{
					case 0 :
						lv_obj_clear_flag(guider_ui.right_line1, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 1 :
						lv_obj_clear_flag(guider_ui.right_line2, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 2 :
						lv_obj_clear_flag(guider_ui.right_line3, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 3 :
						lv_obj_clear_flag(guider_ui.right_line4, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 4 :
						lv_obj_clear_flag(guider_ui.right_line5, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 5 :
						lv_obj_clear_flag(guider_ui.right_line6, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 6 :
						lv_obj_clear_flag(guider_ui.right_line7, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 7 :
						lv_obj_clear_flag(guider_ui.right_line8, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 8 :
						lv_obj_clear_flag(guider_ui.right_line9, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 9 :
						lv_obj_clear_flag(guider_ui.right_line10, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 10 :
						lv_obj_clear_flag(guider_ui.right_line11, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 11 :
						lv_obj_clear_flag(guider_ui.right_line12, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 12 :
						lv_obj_clear_flag(guider_ui.right_line13, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 13 :
						lv_obj_clear_flag(guider_ui.right_line14, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 14 :
						lv_obj_clear_flag(guider_ui.right_line15, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 15 :
						lv_obj_clear_flag(guider_ui.right_line16, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 16 :
						lv_obj_clear_flag(guider_ui.right_line17, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 17 :
						lv_obj_clear_flag(guider_ui.right_line18, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 18 :
						lv_obj_clear_flag(guider_ui.right_line19, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 19 :
						lv_obj_clear_flag(guider_ui.right_line20, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 20 :
						lv_obj_clear_flag(guider_ui.right_line21, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 21 :
						lv_obj_clear_flag(guider_ui.right_line22, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 22 :
						lv_obj_clear_flag(guider_ui.right_line23, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 23 :
						lv_obj_clear_flag(guider_ui.right_line24, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 24 :
						lv_obj_clear_flag(guider_ui.right_line25, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 25 :
						lv_obj_clear_flag(guider_ui.right_line26, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 26 :
						lv_obj_clear_flag(guider_ui.right_line27, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line28, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 27 :
						lv_obj_clear_flag(guider_ui.right_line29, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line30, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 28 :
						lv_obj_clear_flag(guider_ui.right_line31, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line32, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 29 :
						lv_obj_clear_flag(guider_ui.right_line33, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line34, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 30 :
						lv_obj_clear_flag(guider_ui.right_line35, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line36, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 31 :
						lv_obj_clear_flag(guider_ui.right_line37, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line38, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 32 :
						lv_obj_clear_flag(guider_ui.right_line39, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line40, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 33 :
						lv_obj_clear_flag(guider_ui.right_line41, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line42, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 34 :
						lv_obj_clear_flag(guider_ui.right_line43, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line44, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 35 :
						lv_obj_clear_flag(guider_ui.right_line45, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line46, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 36 :
						lv_obj_clear_flag(guider_ui.right_line47, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line48, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 37 :
						lv_obj_clear_flag(guider_ui.right_line49, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line50, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 38 :
						lv_obj_clear_flag(guider_ui.right_line51, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line52, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 39 :
						lv_obj_clear_flag(guider_ui.right_line53, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line54, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 40 :
						lv_obj_clear_flag(guider_ui.right_line55, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line56, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 41 :
						lv_obj_clear_flag(guider_ui.right_line57, LV_OBJ_FLAG_HIDDEN);
						lv_obj_clear_flag(guider_ui.right_line58, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 42 :
						lv_obj_clear_flag(guider_ui.right_line59, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 43 :
						lv_obj_clear_flag(guider_ui.right_line60, LV_OBJ_FLAG_HIDDEN);
						right_draw_line_1_draw_forward_switch_case++;
						break;
					case 44 :
						lv_obj_clear_flag(guider_ui.right_line61, LV_OBJ_FLAG_HIDDEN);
						//right_draw_line_1_draw_forward_switch_case++;
						right_draw_line_1_draw_forward_switch_case = 0;
						right_draw_line_1_draw_forward_switch = 0;
						right_draw_line_1_draw_backward_switch = 1;
						right_draw_line_1_draw_backward_switch_case = 0;
						break;
						break;
//					case 45 :
//						lv_obj_clear_flag(guider_ui.right_line62, LV_OBJ_FLAG_HIDDEN);
//						right_draw_line_1_draw_forward_switch_case++;
//						break;
//					case 46 :
//						lv_obj_clear_flag(guider_ui.right_line63, LV_OBJ_FLAG_HIDDEN);
//
//						right_draw_line_1_draw_forward_switch_case = 0;
//						right_draw_line_1_draw_forward_switch = 0;
//						right_draw_line_1_draw_backward_switch = 1;
//						right_draw_line_1_draw_backward_switch_case = 0;
//						break;
					default:
						break;
					}

				}
				else
				{
					// do nothing
				}

			}

		}

		if(right_line_1_start_timer)
		{
			right_drawing_screen = 0;
			right_drawing_screen_inc_enable = 1;

			right_line_1_start_timer_exp = 0;
			right_line_1_start_timer = 0;
		}
		// 35 msec : keep calling : lv_task_handler()
		if (right_drawing_screen >= 5)  // Minimum : delay for 10 msec --> i.e animation time --> till that time call --> lv_task_handler()
		{
			right_line_1_start_timer_exp = 1;
			right_drawing_screen_inc_enable = 0;
			right_line_1_start_timer = 1;

		}


	//	lv_task_handler();  // Update the display

	}

}
